{
  "backend/main.mo": "Minimal Motoko canister actor with no defined methods.",
  "feature_evidence.json": "Feature evidence metadata linking Valentine’s site requirements to source files and components.",
  "frontend-file-summaries.txt": "Text list summarizing each frontend file’s purpose for reference or build planning.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining Valentine-themed color tokens, dark mode, and base styles.",
  "frontend/index.html": "HTML entry file loading fonts and mounting the React root with main.tsx.",
  "frontend/src/App.tsx": "Root React component rendering the single-page Valentine layout.",
  "frontend/src/components/HeartsBackground.tsx": "Floating hearts animation component generating randomized heart SVG positions.",
  "frontend/src/config/valentineContent.ts": "Central content configuration storing all text, images, and section data for the Valentine site.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor using react-query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication hook and provider implementing Internet Identity login, state management, and identity loading.",
  "frontend/src/index.css": "Defines Tailwind layers, custom Valentine-themed color variables, dark mode variants, and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and InternetIdentityProvider.",
  "frontend/src/pages/ValentineSinglePage.tsx": "Renders the full Valentine page layout by composing multiple themed sections.",
  "frontend/src/sections/FooterSection.tsx": "Displays a themed footer with branding, animated heart icon, and dynamic year.",
  "frontend/src/sections/GallerySection.tsx": "Shows a responsive image gallery using content-driven items with hover effects.",
  "frontend/src/sections/HeroSection.tsx": "Renders the hero banner with animated text, hearts background, and CTA scroll button.",
  "frontend/src/sections/LoveLetterSection.tsx": "Displays a handwritten-style love letter with a hearts background and pastel styling.",
  "frontend/src/sections/OurStorySection.tsx": "Shows the couple’s story and a timeline using cards styled with Valentine colors.",
  "frontend/src/sections/ReasonsILoveYouSection.tsx": "Lists reasons dynamically and allows users to add new entries via input and cards.",
  "frontend/src/sections/SpecialSurpriseSection.tsx": "Provides a revealable surprise message and optional music playback controls.",
  "frontend/tailwind.config.js": "Configures Tailwind with extended Valentine color variables, animations, and plugins.",
  "project_state.json": "Stores project configuration and aesthetic guidelines for a Valentine’s Day single-page website, including required images and existing feature definitions. Contains architectural notes and no known issues."
}