{
  "backend/main.mo": "Empty Motoko actor with no implemented methods.",
  "feature_evidence.json": "Feature evidence report mapping features to related source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining color variables, themes, and base styles.",
  "frontend/index.html": "HTML entry point that loads fonts and mounts the React application.",
  "frontend/src/App.tsx": "Root React component rendering the Valentine page and toast notifications.",
  "frontend/src/components/HeartsBackground.tsx": "Animated floating hearts background component with dense and sparse modes.",
  "frontend/src/config/valentineContent.ts": "Static default Valentine content including hero text, story, reasons, gallery, and surprise settings.",
  "frontend/src/hooks/useActor.ts": "React hook creating and managing a backend actor tied to Internet Identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication hook and provider handling Internet Identity login, state, and persistence.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom pastel Valentine color variables, plus utility classes for gradients, shadows, and themed colors.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and renders the root component.",
  "frontend/src/pages/ValentineSinglePage.tsx": "Composes the full single-page Valentine layout with themed sections and a customization panel wrapped in the personalization provider.",
  "frontend/src/personalization/audioUtils.ts": "Validates audio file type/size and converts audio files to data URLs.",
  "frontend/src/personalization/CustomizePanel.tsx": "Provides a UI panel for editing all personalized text, images, and music, validating files and updating stored personalization data.",
  "frontend/src/personalization/imageUtils.ts": "Validates image file type/size and converts images to data URLs.",
  "frontend/src/personalization/PersonalizationContext.tsx": "Manages personalization state, merging overrides with defaults and persisting them via localStorage.",
  "frontend/src/personalization/storage.ts": "Handles loading, saving, and clearing personalization overrides in localStorage.",
  "frontend/src/personalization/types.ts": "Defines TypeScript interfaces for all personalized content structures and override types.",
  "frontend/src/sections/FooterSection.tsx": "Renders a themed footer using personalized text and links, including animated heart elements.",
  "frontend/src/sections/GallerySection.tsx": "Displays a responsive image gallery using personalized items and handles fallback when custom images fail to load.",
  "frontend/src/sections/HeroSection.tsx": "Shows the personalized hero banner with heading, subheading, and CTA button that scrolls to the story section.",
  "frontend/src/sections/LoveLetterSection.tsx": "Renders the personalized love letter with decorative background and styled handwritten text.",
  "frontend/src/sections/OurStorySection.tsx": "Renders the Our Story section using personalized text and a timeline mapped into styled cards.",
  "frontend/src/sections/ReasonsILoveYouSection.tsx": "Displays a list of love reasons with heart-styled cards and allows adding new reasons via input.",
  "frontend/src/sections/SpecialSurpriseSection.tsx": "Shows a revealable surprise message and optional music player with play/pause controls using personalization data.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugin usage for the frontend styling.",
  "project_state.json": "Stores project metadata, requirements, architecture notes, and existing feature definitions."
}