{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "In-app personalization for Valentine page (copy, photos, music)",
  "requirements": [
    {
      "id": "REQ-11",
      "summary": "Add an in-page Customize panel to edit all main copy sections at runtime, apply changes immediately, and reset to defaults from valentineContent.",
      "acceptanceCriteria": [
        "A “Customize” entry point is available on the page (e.g., a small floating button or a top-of-page link) and opens a panel/modal/drawer.",
        "The panel exposes editable fields for the main text content across all sections (Hero, Our Story, Reasons, Love Letter, Surprise, Footer).",
        "Edits are immediately reflected in the rendered page after saving/applying changes.",
        "A “Reset to defaults” action restores the original values from frontend/src/config/valentineContent.ts."
      ],
      "file_operations": [
        {
          "path": "frontend/src/personalization/types.ts",
          "operation": "create",
          "description": "Define TypeScript types for personalized Valentine content (copy fields for Hero/Story/Reasons/LoveLetter/Surprise/Footer) and a patch/update shape used by the Customize UI."
        },
        {
          "path": "frontend/src/personalization/PersonalizationContext.tsx",
          "operation": "create",
          "description": "Create a React context/provider that exposes (a) resolved content (defaults merged with user overrides), (b) update/apply functions for copy fields, and (c) reset-to-defaults. This should be the single source of truth for sections to render from."
        },
        {
          "path": "frontend/src/personalization/CustomizePanel.tsx",
          "operation": "create",
          "description": "Implement the in-page Customize panel UI with editable inputs/textarea fields for Hero name/heading/subheading, Our Story story text, Reasons list items, Love Letter text, Surprise message, and Footer name/text; include Apply/Close and Reset-to-defaults actions. Use shadcn-ui components (e.g., Button, Input, Card, etc.) to compose the panel UI without modifying anything under frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ValentineSinglePage.tsx",
          "operation": "modify",
          "description": "Wire the Customize entry point (e.g., floating button) into the single-page layout and mount CustomizePanel; wrap the page (or relevant subtree) in the Personalization provider so all sections can read personalized content."
        },
        {
          "path": "frontend/src/sections/HeroSection.tsx",
          "operation": "modify",
          "description": "Switch Hero rendering to consume personalized content from the personalization context instead of importing valentineContent directly; ensure heading/name/subheading/CTA reflect customized values immediately."
        },
        {
          "path": "frontend/src/sections/OurStorySection.tsx",
          "operation": "modify",
          "description": "Switch Our Story section rendering to consume personalized title/story/timeline text from the personalization context instead of importing valentineContent directly."
        },
        {
          "path": "frontend/src/sections/ReasonsILoveYouSection.tsx",
          "operation": "modify",
          "description": "Switch Reasons section title/list rendering to consume personalized values from the personalization context; ensure the displayed list corresponds to customized items."
        },
        {
          "path": "frontend/src/sections/LoveLetterSection.tsx",
          "operation": "modify",
          "description": "Switch Love Letter section rendering to consume personalized title/message from the personalization context instead of importing valentineContent directly."
        },
        {
          "path": "frontend/src/sections/SpecialSurpriseSection.tsx",
          "operation": "modify",
          "description": "Switch Surprise section title/button/message rendering to consume personalized values from the personalization context; ensure customized surprise message is used after reveal."
        },
        {
          "path": "frontend/src/sections/FooterSection.tsx",
          "operation": "modify",
          "description": "Switch Footer section text rendering to consume personalized footer name/text from the personalization context instead of importing valentineContent directly."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Persist all personalization changes locally in the browser using localStorage with safe fallback behavior and reset clearing storage.",
      "acceptanceCriteria": [
        "After customizing and refreshing the page, the customized values are restored automatically.",
        "Reset clears the saved customization and reverts to the default config values.",
        "The site still works normally if localStorage is unavailable or cleared (falls back to defaults)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/personalization/storage.ts",
          "operation": "create",
          "description": "Add localStorage helper utilities for loading/saving/clearing personalization state with robust error handling (try/catch) and schema/versioning as needed; return defaults when storage is unavailable."
        },
        {
          "path": "frontend/src/personalization/PersonalizationContext.tsx",
          "operation": "modify",
          "description": "Integrate storage.ts so the provider hydrates personalization state from localStorage on startup, persists updates on apply, and clears storage on reset; ensure graceful fallback to defaults if storage is blocked or cleared."
        },
        {
          "path": "frontend/src/personalization/CustomizePanel.tsx",
          "operation": "modify",
          "description": "Ensure Apply triggers persistence via the personalization provider and Reset clears persisted customizations; keep the UI responsive even if storage operations fail. Use shadcn-ui components to present actions without editing frontend/src/components/ui. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Add image personalization for Gallery images via local file selection in the Customize panel with previews, localStorage persistence, reset, and graceful fallback on load failure.",
      "acceptanceCriteria": [
        "The Customize panel includes controls to replace each Gallery item image via a local file picker.",
        "Selected images preview correctly in the panel and render in the Gallery grid in place of the placeholders.",
        "Selections persist across refresh via localStorage (e.g., stored as data URLs) and can be reset to defaults.",
        "If a selected image fails to load, the UI gracefully falls back to the default placeholder image."
      ],
      "file_operations": [
        {
          "path": "frontend/src/personalization/imageUtils.ts",
          "operation": "create",
          "description": "Add helpers to validate image file types/sizes (lightweight), convert selected image files to data URLs for previews/persistence, and safely revoke any object URLs if used."
        },
        {
          "path": "frontend/src/personalization/types.ts",
          "operation": "modify",
          "description": "Extend personalization types to include gallery image overrides (e.g., per-index image data URL) while retaining default image paths from frontend/src/config/valentineContent.ts."
        },
        {
          "path": "frontend/src/personalization/CustomizePanel.tsx",
          "operation": "modify",
          "description": "Add per-gallery-item file inputs in the Customize panel, show previews for selected images, and wire updates into personalization state so Gallery updates immediately. Use shadcn-ui components for consistent inputs/buttons without modifying frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/sections/GallerySection.tsx",
          "operation": "modify",
          "description": "Render gallery images from personalization context, preferring user-selected data URLs over default images. Add an image load error handler to gracefully fall back to the default placeholder at frontend/public/assets/generated/gallery-placeholder.dim_800x800.png when the selected image cannot be displayed."
        },
        {
          "path": "frontend/src/personalization/storage.ts",
          "operation": "modify",
          "description": "Ensure gallery image overrides (data URLs) are included in the persisted personalization payload, with safe load handling and reset behavior."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Add music personalization to set Surprise background music from config path or user-selected local audio file, with user-initiated playback only, play/pause controls after reveal, persistence, reset, and a clear placeholder when unavailable.",
      "acceptanceCriteria": [
        "A local audio file can be selected in the Customize panel and used as the Surprise section’s music source.",
        "Music playback only starts as a result of an explicit user interaction (e.g., clicking the Surprise reveal button or pressing Play).",
        "After the surprise is revealed, the UI provides Play/Pause controls and reflects the current playing state.",
        "Music selection persists across refresh via localStorage and can be reset to the default valentineContent.surprise.musicPath behavior.",
        "If no music is available (no file selected and the configured path is missing), the UI shows a clear placeholder/instructional message (English)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/personalization/audioUtils.ts",
          "operation": "create",
          "description": "Add helpers to validate audio file types, convert selected audio files to a persistable source (e.g., data URL), and expose a resolved music source that prefers user selection over default config path."
        },
        {
          "path": "frontend/src/personalization/types.ts",
          "operation": "modify",
          "description": "Extend personalization types to include an optional Surprise music override (e.g., audio data URL) while retaining default behavior via valentineContent.surprise.musicPath."
        },
        {
          "path": "frontend/src/personalization/CustomizePanel.tsx",
          "operation": "modify",
          "description": "Add a local audio file picker for Surprise music, show the selected file name/status, and wire changes into personalization state so SpecialSurpriseSection uses the chosen source. Use shadcn-ui components for inputs/actions without modifying frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/sections/SpecialSurpriseSection.tsx",
          "operation": "modify",
          "description": "Update Surprise music logic to use personalization-resolved music source (user-selected audio or default config path). Ensure playback only begins on explicit user interaction (reveal button click and/or Play button), provide Play/Pause controls only after reveal, sync UI playing state with the audio element, and show a clear English placeholder/instruction when no music source is available."
        },
        {
          "path": "frontend/src/personalization/storage.ts",
          "operation": "modify",
          "description": "Persist and restore the selected audio override via localStorage; ensure Reset clears it and restores default valentineContent.surprise.musicPath behavior."
        }
      ]
    }
  ]
}